wave.danopia.net/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "display_name", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2009-10-22 00:18:01', '2009-10-22 00:18:01', '717b3ea465a77ae9f54a6eeb55d8069f9d3296b8af4789fba3e1ddc818c5396fd79cb0ca81596a9bcbbaba24c9a8a04b3cec75263b9ecc08bc5d2323d2f6bf75', 'PJyTrmwgEQOfaKGlWJJj', 'KaXiLeT8mC8uuEuy2kP-', '192.168.1.46', 'AAzRkGA6qYIC3WaHLt4v', '2009-10-22 00:18:01', 0, '23e8275608341e6a833a86e57217ed118f584b0e083066769f0cad5e0b3fca0bdc82554290d184cc8cc35420d0dee823ad0fae79f73fbcde2870ab010c94a011', 1, 'Daniel danopia', 'danopia', 'me@danopia.net', NULL, '2009-10-22 00:18:01')